rosetta-source/src/main/resources/cdm-sample-files/dtcc-11-0/DDL_NewTrade5.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/  ../../schemas/dtcc-11-0/soap-envelope.xsd"
        xmlns:fpml="http://www.fpml.org/2010/FpML-4-9"  xmlns:rm="OTC_RM_11-0"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:mtc="OTC_Matching_11-0">
    <env:Header>
        <OTC_RM
            xmlns="OTC_RM_11-0">
            <Manifest>
                <TradeMsg>
                    <Activity>New</Activity>
                    <Status>Confirmed</Status>
                    <TransType>Trade</TransType>
                    <ProductType>CreditDefaultSwapShort</ProductType>
                    <Submitter>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00001234"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">SJDBTEST2210OS</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0006130535</fpml:tradeId>
                        </partyTradeIdentifier>
                    </Submitter>
                    <ContraTradeId>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00005678"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">SJDBTEST2210</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0006130535</fpml:tradeId>
                        </partyTradeIdentifier>
                    </ContraTradeId>
                    <USI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier">9J6AQFWC2C</USIIssuer>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier">TRADESERV20181022211981783OAVSFL</USITradeId>
                    </USI>
                    <OriginatingUSI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier"/>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier"/>
                    </OriginatingUSI>
                </TradeMsg>
                <MsgId>MSERV20181022.0006130535</MsgId>
            </Manifest>
            <Delivery>
                <RouteInfo>
                    <From>MarkitSERV</From>
                    <To>DTCC</To>
                </RouteInfo>
                <RouteHist>
                    <Route>
                        <RouteAddress>www.markitserv.net</RouteAddress>
                        <ReceiveTime>2018-10-22T08:39:37.457-04:00</ReceiveTime>
                        <ReleaseTime>2018-10-22T08:39:55.910-04:00</ReleaseTime>
                    </Route>
                </RouteHist>
            </Delivery>
        </OTC_RM>
    </env:Header>
    <env:Body>
        <OTC_Matching
            xmlns="OTC_Matching_11-0">
            <Activity>New</Activity>
            <Status>Confirmed</Status>
            <WarehouseState>
                <WarehouseStatus>Submit</WarehouseStatus>
                <WarehousePositionType>Gold</WarehousePositionType>
            </WarehouseState>
            <Trade>
                <FpML version="4-9" xmlns="http://www.fpml.org/2010/FpML-4-9"
                      xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"
                      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                      xsi:schemaLocation="http://www.fpml.org/2010/FpML-4-9 ../../schemas/fpml-4-9/fpml-main-4-9.xsd
					   http://www.w3.org/2000/09/xmldsig# ../../schemas/fpml-4-9/xmldsig-core-schema.xsd"
                      xsi:type="RequestTradeConfirmation">
                    <header>
                        <messageId messageIdScheme="perFpMLReqmt">MSERV20181022.0006130535</messageId>
                        <sentBy>DTCC00001234</sentBy>
                        <sendTo>DTCC00005678</sendTo>
                        <creationTimestamp>2018-10-22T12:39:55.914Z</creationTimestamp>
                    </header>
                    <trade>
                        <tradeHeader
                            xmlns="http://www.fpml.org/2010/FpML-4-9">
                            <partyTradeIdentifier>
                                <fpml:partyReference href="DTCC00001234"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">SJDBTEST2210OS</fpml:tradeId>
                                <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0006130535</fpml:tradeId>
                            </partyTradeIdentifier>
                            <partyTradeIdentifier>
                                <fpml:partyReference href="DTCC00005678"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">SJDBTEST2210</fpml:tradeId>
                                <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0006130535</fpml:tradeId>
                            </partyTradeIdentifier>
                            <tradeDate>2018-09-25</tradeDate>
                        </tradeHeader>
                        <creditDefaultSwap>
                            <generalTerms>
                                <effectiveDate>
                                    <fpml:unadjustedDate>2018-09-25</fpml:unadjustedDate>
                                    <fpml:dateAdjustments>
                                        <fpml:businessDayConvention>NotApplicable</fpml:businessDayConvention>
                                    </fpml:dateAdjustments>
                                </effectiveDate>
                                <scheduledTerminationDate>
                                    <fpml:adjustableDate>
                                        <fpml:unadjustedDate>2046-09-25</fpml:unadjustedDate>
                                        <fpml:dateAdjustments>
                                            <businessDayConvention>NotApplicable</businessDayConvention>
                                        </fpml:dateAdjustments>
                                    </fpml:adjustableDate>
                                </scheduledTerminationDate>
                                <sellerPartyReference href="DTCC00005678"/>
                                <buyerPartyReference href="DTCC00001234"/>
                                <dateAdjustments>
                                    <businessDayConvention>NotApplicable</businessDayConvention>
                                    <businessCenters>
                                        <businessCenter businessCenterScheme="http://www.fpml.org/coding-scheme/business-center">GBLO</businessCenter>
                                        <businessCenter businessCenterScheme="http://www.fpml.org/coding-scheme/business-center">USNY</businessCenter>
                                    </businessCenters>
                                </dateAdjustments>
                                <referenceInformation>
                                    <fpml:referenceEntity>
                                        <fpml:entityName entityNameScheme="http://www.fpml.org/spec/2003/entity-name-RED">THEISSUEROFTHEREFERENCEOBLIGATION</fpml:entityName>
                                    </fpml:referenceEntity>
                                    <referenceObligation>
                                        <mortgage>
                                            <instrumentId instrumentIdScheme="http://www.fpml.org/spec/2002/instrument-id-ISIN">US02147DAK72</instrumentId>
                                            <insurer>
                                                <entityName>NotApplicable</entityName>
                                            </insurer>
                                            <maturity>2046-09-25</maturity>
                                            <paymentFrequency>
                                                <periodMultiplier>1</periodMultiplier>
                                                <period>M</period>
                                            </paymentFrequency>
                                            <originalPrincipalAmount>6255000.00</originalPrincipalAmount>
                                            <sector mortgageSectorScheme="http://www.fpml.org/coding-scheme/mortgage-sector">RMBS</sector>
                                        </mortgage>
                                    </referenceObligation>
                                </referenceInformation>
                            </generalTerms>
                            <feeLeg>
                                <paymentDelay>true</paymentDelay>
                            </feeLeg>
                            <protectionTerms>
                                <calculationAmount id="calculationAmount">
                                    <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                                    <amount>23000000.00000</amount>
                                </calculationAmount>
                                <floatingAmountEvents>
                                    <interestShortfall>
                                        <interestShortfallCap>Fixed</interestShortfallCap>
                                        <compounding>false</compounding>
                                        <rateSource floatingRateIndexScheme="http://www.fpml.org/coding-scheme/floating-rate-index">USD-LIBOR-BBA</rateSource>
                                    </interestShortfall>
                                    <floatingAmountProvisions/>
                                </floatingAmountEvents>
                            </protectionTerms>
                        </creditDefaultSwap>
                        <calculationAgent>
                            <calculationAgentPartyReference href="DTCC00005678"/>
                        </calculationAgent>
                        <calculationAgentBusinessCenter businessCenterScheme="http://www.fpml.org/spec/2000/business-center">USNY</calculationAgentBusinessCenter>
                        <documentation>
                            <masterAgreement>
                                <masterAgreementType masterAgreementTypeScheme="http://dtcc.com/coding-scheme/master-agreement-type">ISDA</masterAgreementType>
                                <masterAgreementVersion masterAgreementVersionScheme="http://www.fpml.org/coding-scheme/master-agreement-version">2002</masterAgreementVersion>
                                <masterAgreementDate>1995-07-28</masterAgreementDate>
                            </masterAgreement>
                            <contractualDefinitions contractualDefinitionsScheme="http://www.fpml.org/coding-scheme/contractual-definitions">ISDA2003Credit</contractualDefinitions>
                            <contractualTermsSupplement>
                                <type contractualSupplementScheme="http://www.fpml.org/coding-scheme/contractual-supplement">StandardTermsSupplement</type>
                                <publicationDate>2018-10-09</publicationDate>
                            </contractualTermsSupplement>
                        </documentation>
                    </trade>
                    <party id="DTCC00001234">
                        <fpml:partyId partyIdScheme="DTCC">DTCC00001234</fpml:partyId>
                        <fpml:partyId partyIdScheme="http://www.fpml.org/coding-scheme/external/iso17442">DTCC549300FSLUWD8ETI2P24</fpml:partyId>
                    </party>
                    <party id="DTCC00005678">
                        <fpml:partyId partyIdScheme="DTCC">DTCC00005678</fpml:partyId>
                        <fpml:partyId partyIdScheme="http://www.fpml.org/coding-scheme/external/iso17442">DTCC549300FSLUWD8ETI2P24</fpml:partyId>
                    </party>
                </FpML>
            </Trade>
        </OTC_Matching>
    </env:Body>
</env:Envelope>